Revit 2026 API

# DimensionFamilyLabel Property

---

The family parameter label of the dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter FamilyLabel { get; set; }
```
```vb
Public Property FamilyLabel As FamilyParameter
	Get
	Set
```
```cpp
public:
property FamilyParameter^ FamilyLabel {
	FamilyParameter^ get ();
	void set (FamilyParameter^ value);
}
```
```fsharp
member FamilyLabel : FamilyParameter with get, set
```

#### Property Value

FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the family parameter's ParameterType is not suitable for this dimension. |
| InvalidOperationException | Thrown when dimension can not be labeled. |
| InvalidOperationException | Thrown when failed to get the BuiltInParameter DIM_LABEL. |

A dimension only can be labeled to a family parameter in a family document. When the dimension is labeled by a reporting parameter, the dimension value drives the parameter value. When the parameter is labeled by a non-reporting, the value of the parameter drives the dimension. If the dimension is multi-segmented, each segment of the dimension is driven by the same parameter value. Multi-segmented dimensions cannot be labeled by reporting parameters. To unbind the family parameter, set this property to .

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace